package question08;

public class Method {
	
	/**
	 * ①2つの引数を使って四角形の面積を計算し、その計算結果を戻り値とするメソッドを作成しなさい。
	 * 戻り値：int型
	 */
	
	
	
	/**
	 * ②2つの引数を使って三角形の面積を計算し、その計算結果を戻り値とするメソッドを作成しなさい。
	 * 戻り値：double型
	 */
	
	
	
	/**
	 * ③1つの引数を使って円の面積を計算し、その計算結果を戻り値とするメソッドを作成しなさい。
	 * 戻り値：double型
	 * 円周率：3.14
	 */
	
	
	/**
	 * ④名前を入力するためのメソッドを作成し、その入力結果を戻り値とする
	 * 戻り値：String型
	 */
	
	
	/**
	 * ⑤引数の値が0以上10未満の場合はtrueをそれ以外の場合はfalseを戻り値とするメソッドを作成
	 * ヒント：条件分岐の前にtrueとfalseを保存する変数を作り、条件分岐の処理でその変数にtrueかfalseを保存する。
	 */
	

}
